tap 'homebrew/cask-fonts'
tap 'neovim/neovim'

# System
brew 'nodenv'
brew 'node-build'
brew 'pyenv'

# Shell
brew 'zsh'
brew 'zsh-completions'

# CLI/Term Tools
brew 'curl'
brew 'diff-so-fancy'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'gping'
brew 'jq'
brew 'neovim'
brew 'reattach-to-user-namespace'
brew 'subversion'
brew 'tmux'
brew 'wget'
brew 'yq'

# Apps
# cask '1password'
cask 'alfred'
cask 'bartender'
cask 'docker'
cask 'hazel'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'maestral'
cask 'micro-snitch'
cask 'monitorcontrol'
cask 'muzzle'
cask 'rectangle'
cask 'the-unarchiver'
cask 'visual-studio-code'

# Fonts
cask 'font-menlo-for-powerline'
# https://www.nerdfonts.com/
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
