tap 'caskroom/fonts'
tap 'neovim/neovim'

# System
brew 'n'
brew 'ruby-install'
brew 'chruby'
brew 'golang'
brew 'python'
brew 'python3'

# Docker
cask 'docker'

# Kubernetes
brew 'kubectx'

# Shells/CLI
brew 'zsh'
brew 'zsh-completions'

# Terminal Tools
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'jq'

# CLI apps
brew 'awscli'
brew 'diff-so-fancy'
cask 'google-cloud-sdk'
brew 'heroku-toolbelt'
brew 'git'
brew 'hub'
brew 'curl'
brew 'wget'
brew 'shellcheck'
brew 'mas' # CLI for Mac App Store
brew 'mackup'

# Communication
cask 'skype'
cask 'slack'

# Editors & IDEs
brew 'neovim'
brew 'vim'
cask 'sublime-text'
cask 'visual-studio-code'

# Music
cask 'spotify'

# Web
cask 'google-chrome'

# DevOps
brew 'packer'
brew 'terraform'

# Other Apps
cask '1password'
cask 'a-better-finder-rename'
cask 'alfred'
cask 'arq'
cask 'bartender'
cask 'bettertouchtool'
cask 'betterzip'
cask 'carbon-copy-cloner'
cask 'dropbox'
cask 'expandrive'
cask 'flux'
cask 'google-backup-and-sync'
cask 'hazel'
cask 'inssider'
cask 'istat-menus'
# cask 'karabiner-elements' # Placeholder
cask 'keepingyouawake'
cask 'kindle'
cask 'microsoft-office'
cask 'sourcetree'
cask 'spectacle'
cask 'steam'
cask 'transmit'
cask 'vlc'

# Databases
cask 'postgres'

# Database GUI
cask 'postico'
cask 'querious'

# Security
cask 'encryptme'
cask 'gpgtools'
cask 'keybase'
cask 'viscosity'
cask 'little-snitch'
cask 'micro-snitch'
cask 'knockknock'
cask 'blockblock'
cask 'ransomwhere'
cask 'nordvpn'

# Java
brew 'jenv'
cask 'java'

# Fonts
cask 'font-menlo-for-powerline'
cask 'font-source-code-pro-for-powerline'

# Mac App Store apps
mas 'Annotate', id: 918207447
mas 'DaisyDisk', id: 411643860
mas 'Gemini', id: 463541543
mas 'Media Inspector', id: 419975242
mas 'Parcel', id: 639968404
mas 'Microsoft Remote Desktop', id: 715768417
